status/2021/05nov21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>30 October 2021 - 05 November 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">30 October 2021 - 05 November 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org83e85ce">1. MIT OCW</a>
<ul>
<li><a href="#org9670d00">1.1. 18.01 - Single Variable Calculus</a>
<ul>
<li><a href="#org1c0d95a">1.1.1. Sessions 57-59</a></li>
</ul>
</li>
<li><a href="#orgdac5dcc">1.2. 8.01 - Physics I - Classical Mechanics</a>
<ul>
<li><a href="#orgbaa017b">1.2.1. Sessions 28-31</a></li>
<li><a href="#org5f462e0">1.2.2. Labs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org81f547e">2. Halloween String of Lights</a></li>
<li><a href="#orgcbc45b2">3. Trojan Source Mitigator</a></li>
<li><a href="#org0bf70a9">4. WWVB Decoder</a></li>
<li><a href="#org43d8377">5. Santa Cruz Weather Station</a></li>
<li><a href="#org5e63511">6. Marble Computation</a>
<ul>
<li><a href="#orgde7fde6">6.1. Next Steps</a>
<ul>
<li><a href="#orgdcc2a1e">6.1.1. Continue Reversible Computation Study</a></li>
<li><a href="#orgaeab60d">6.1.2. Prototype Marble inverter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga9eeda8">7. ca-r</a>
<ul>
<li><a href="#org37a757b">7.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org1ba558a">8. us-index-map</a>
<ul>
<li><a href="#orgf207f23">8.1. error analysis</a></li>
</ul>
</li>
<li><a href="#org609d1c1">9. Sun Ultra 10</a>
<ul>
<li><a href="#org4951961">9.1. Next steps</a>
<ul>
<li><a href="#org9c810be">9.1.1. Serial debug</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6731d6a">10. Apple iMac G4</a>
<ul>
<li><a href="#orga3e1b0b">10.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org0884dd7">11. Davies Brothel</a></li>
<li><a href="#orgb730cdc">12. Linux Audio</a>
<ul>
<li><a href="#orga9ebcbc">12.1. pvanal to spectrogram</a>
<ul>
<li><a href="#org1af12c8">12.1.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org48d2df3">12.2. CSound programming.</a>
<ul>
<li><a href="#org5cd791c">12.2.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#orgb1aa749">12.3. Faust programming</a>
<ul>
<li><a href="#orgcfd769e">12.3.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org855e9b8">13. EPICS</a>
<ul>
<li><a href="#orgf9ba098">13.1. Next steps</a>
<ul>
<li><a href="#org5b8ad61">13.1.1. Started CGR-101 SCPI interface</a></li>
<li><a href="#orgc8430ef">13.1.2. u3scpi network port testing</a></li>
<li><a href="#orgcd074d8">13.1.3. initial EPICS interface</a></li>
<li><a href="#org09ade42">13.1.4. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgeed5731">14. Brini Tracker II</a>
<ul>
<li><a href="#org37817c3">14.1. Next steps</a>
<ul>
<li><a href="#org93b75a2">14.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#org628e057">14.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org78c2da5">14.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3fcb1c7">15. wktcolor</a>
<ul>
<li><a href="#org676500f">15.1. Next steps</a>
<ul>
<li><a href="#orgae47cf5">15.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org741b990">16. wktplot</a>
<ul>
<li><a href="#orga68f9d3">16.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orge354b98">17. AMDGPU</a>
<ul>
<li><a href="#orgb3e9585">17.1. Next step</a>
<ul>
<li><a href="#orgcf6d396">17.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org15b248f">18. Ninja v Make</a>
<ul>
<li><a href="#org77d510e">18.1. Next Step</a>
<ul>
<li><a href="#org067f036">18.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org963ad02">19. GMP Forth</a>
<ul>
<li><a href="#orgceebca6">19.1. Need to think about adding floating point support</a></li>
<li><a href="#orge856801">19.2. Port to non-Linux OS</a></li>
</ul>
</li>
<li><a href="#orgf23f17c">20. Swocer</a>
<ul>
<li><a href="#org1381f4d">20.1. Most crashing addressed</a></li>
<li><a href="#org579e90f">20.2. Added outline for 'bottle' test</a></li>
<li><a href="#orge40e6e4">20.3. Next steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Halloween and Almost DST Edition
</p>

<div id="outline-container-org83e85ce" class="outline-2">
<h2 id="org83e85ce"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9670d00" class="outline-3">
<h3 id="org9670d00"><span class="section-number-3">1.1.</span> 18.01 - Single Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org1c0d95a" class="outline-4">
<h4 id="org1c0d95a"><span class="section-number-4">1.1.1.</span> Sessions 57-59</h4>
</div>
</div>
<div id="outline-container-orgdac5dcc" class="outline-3">
<h3 id="orgdac5dcc"><span class="section-number-3">1.2.</span> 8.01 - Physics I - Classical Mechanics</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgbaa017b" class="outline-4">
<h4 id="orgbaa017b"><span class="section-number-4">1.2.1.</span> Sessions 28-31</h4>
</div>
<div id="outline-container-org5f462e0" class="outline-4">
<h4 id="org5f462e0"><span class="section-number-4">1.2.2.</span> Labs</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
There's a version of the course (8.01x) that has labs. Gathering
materials Needed for such.
</p>
</div>
<ol class="org-ol">
<li><a id="org32a2815"></a>Lab Power Supply<br />
<div class="outline-text-5" id="text-1-2-2-1">
<p>
One of the lab items needed is a power supply. Why is it that with all
the piles of electronic parts I have, I can't seem to locate an LM317?
Playing around with a design for a mixed switcher and linear supply.
Actually 2 switchers: 24V/2A switcher -&gt; Programmable Buck Switcher -&gt; Programmable Linear.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org81f547e" class="outline-2">
<h2 id="org81f547e"><span class="section-number-2">2.</span> Halloween String of Lights</h2>
<div class="outline-text-2" id="text-2">
<p>
Complete.
</p>
</div>
</div>
<div id="outline-container-orgcbc45b2" class="outline-2">
<h2 id="orgcbc45b2"><span class="section-number-2">3.</span> Trojan Source Mitigator</h2>
<div class="outline-text-2" id="text-3">
<p>
tsm - tool to detect "Trojan Source" exploits
</p>
</div>
</div>
<div id="outline-container-org0bf70a9" class="outline-2">
<h2 id="org0bf70a9"><span class="section-number-2">4.</span> WWVB Decoder</h2>
<div class="outline-text-2" id="text-4">
<p>
WWVB time format decoder. Miserable failure so far.
</p>
</div>
</div>
<div id="outline-container-org43d8377" class="outline-2">
<h2 id="org43d8377"><span class="section-number-2">5.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-5">
<p>
Rain Gauge still working.
</p>
</div>
</div>
<div id="outline-container-org5e63511" class="outline-2">
<h2 id="org5e63511"><span class="section-number-2">6.</span> Marble Computation</h2>
<div class="outline-text-2" id="text-6">
<p>
Collected materials (thin copper plate, copper PCB blanks) for prototyping.
</p>
</div>
<div id="outline-container-orgde7fde6" class="outline-3">
<h3 id="orgde7fde6"><span class="section-number-3">6.1.</span> Next Steps</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orgdcc2a1e" class="outline-4">
<h4 id="orgdcc2a1e"><span class="section-number-4">6.1.1.</span> Continue Reversible Computation Study</h4>
</div>
<div id="outline-container-orgaeab60d" class="outline-4">
<h4 id="orgaeab60d"><span class="section-number-4">6.1.2.</span> Prototype Marble inverter</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
Using dual rail differential logic (left/,right/1), an inverter
merely switches sides. Now thinking an over-center spring controlling
a 'side gate' controlled by a pair of sense levers.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orga9eeda8" class="outline-2">
<h2 id="orga9eeda8"><span class="section-number-2">7.</span> ca-r</h2>
<div class="outline-text-2" id="text-7">
<p>
Issue #33 seems to have fixed itself.
</p>
</div>
<div id="outline-container-org37a757b" class="outline-3">
<h3 id="org37a757b"><span class="section-number-3">7.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Wait for further breakage.
</p>
</div>
</div>
</div>
<div id="outline-container-org1ba558a" class="outline-2">
<h2 id="org1ba558a"><span class="section-number-2">8.</span> us-index-map</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgf207f23" class="outline-3">
<h3 id="orgf207f23"><span class="section-number-3">8.1.</span> error analysis</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Started an error analysis on the USGS topomaps<sub>all.csv</sub> index file. Nothing obvious pops up,
and the error reported by Maureen would be impossible to catch anyway.
</p>
</div>
</div>
</div>
<div id="outline-container-org609d1c1" class="outline-2">
<h2 id="org609d1c1"><span class="section-number-2">9.</span> Sun Ultra 10</h2>
<div class="outline-text-2" id="text-9">
<p>
Trying to see what state it is in. Fires up but no video. Need DB25M to
debug over serial port.
</p>
</div>
<div id="outline-container-org4951961" class="outline-3">
<h3 id="org4951961"><span class="section-number-3">9.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org9c810be" class="outline-4">
<h4 id="org9c810be"><span class="section-number-4">9.1.1.</span> Serial debug</h4>
</div>
</div>
</div>
<div id="outline-container-org6731d6a" class="outline-2">
<h2 id="org6731d6a"><span class="section-number-2">10.</span> Apple iMac G4</h2>
<div class="outline-text-2" id="text-10">
<p>
Building userland may be a PITA due to lack of RAM. Build would often
segfault.
</p>
</div>
<div id="outline-container-orga3e1b0b" class="outline-3">
<h3 id="orga3e1b0b"><span class="section-number-3">10.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Not sure.
</p>
</div>
</div>
</div>

<div id="outline-container-org0884dd7" class="outline-2">
<h2 id="org0884dd7"><span class="section-number-2">11.</span> Davies Brothel</h2>
<div class="outline-text-2" id="text-11">
<p>
Hearing: 28 October; Department 37 (held) Looks like a new case C1923172,
maybe it's a consolidation? Who knows.
</p>
</div>
</div>
<div id="outline-container-orgb730cdc" class="outline-2">
<h2 id="orgb730cdc"><span class="section-number-2">12.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orga9ebcbc" class="outline-3">
<h3 id="orga9ebcbc"><span class="section-number-3">12.1.</span> pvanal to spectrogram</h3>
<div class="outline-text-3" id="text-12-1">
<p>
Enough of libriffr and libpvocf work to start pvoctool
<a href="https://github.com/daniel-kelley/pvoctool">https://github.com/daniel-kelley/pvoctool</a>. Have HDF5 output and
text delimited output for octave. Can import PVOC data to octave
spectrogram for display.
</p>
</div>
<div id="outline-container-org1af12c8" class="outline-4">
<h4 id="org1af12c8"><span class="section-number-4">12.1.1.</span> Next steps</h4>
<div class="outline-text-4" id="text-12-1-1">
<p>
Loop analysis
</p>
</div>
</div>
</div>
<div id="outline-container-org48d2df3" class="outline-3">
<h3 id="org48d2df3"><span class="section-number-3">12.2.</span> CSound programming.</h3>
<div class="outline-text-3" id="text-12-2">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-org5cd791c" class="outline-4">
<h4 id="org5cd791c"><span class="section-number-4">12.2.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-12-2-1">
</div>
<ol class="org-ol">
<li><a id="orgc9433d6"></a>loscil demo<br /></li>
<li><a id="orgcb1e813"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgb1aa749" class="outline-3">
<h3 id="orgb1aa749"><span class="section-number-3">12.3.</span> Faust programming</h3>
<div class="outline-text-3" id="text-12-3">
</div>
<div id="outline-container-orgcfd769e" class="outline-4">
<h4 id="orgcfd769e"><span class="section-number-4">12.3.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-12-3-1">
</div>
<ol class="org-ol">
<li><a id="org51d5dad"></a>GAC Patch save/restore<br /></li>
<li><a id="org47cae52"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-12-3-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="org47dc119"></a>OSC control surface<br />
<div class="outline-text-5" id="text-12-3-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="orgecbc5dd"></a>Faust/csound<br />
<div class="outline-text-5" id="text-12-3-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org855e9b8" class="outline-2">
<h2 id="org855e9b8"><span class="section-number-2">13.</span> EPICS</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orgf9ba098" class="outline-3">
<h3 id="orgf9ba098"><span class="section-number-3">13.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-13-1">
</div>
<div id="outline-container-org5b8ad61" class="outline-4">
<h4 id="org5b8ad61"><span class="section-number-4">13.1.1.</span> Started CGR-101 SCPI interface</h4>
<div class="outline-text-4" id="text-13-1-1">
</div>
<ol class="org-ol">
<li><a id="org9b74e19"></a>Will help test u3scpi<br /></li>
<li><a id="orga5a19d3"></a>Using flex/bison SCPI parser<br />
<div class="outline-text-5" id="text-13-1-1-2">
<p>
Added error queue, outline for * ESE and * ESE?.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgc8430ef" class="outline-4">
<h4 id="orgc8430ef"><span class="section-number-4">13.1.2.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-orgcd074d8" class="outline-4">
<h4 id="orgcd074d8"><span class="section-number-4">13.1.3.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org09ade42" class="outline-4">
<h4 id="org09ade42"><span class="section-number-4">13.1.4.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-orgeed5731" class="outline-2">
<h2 id="orgeed5731"><span class="section-number-2">14.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-14">
<p>
Maybe this can be simplified to just the GPS module in 'tracking' mode
(which gets carried around), and a separate docking module to extract
the data.
</p>
</div>
<div id="outline-container-org37817c3" class="outline-3">
<h3 id="org37817c3"><span class="section-number-3">14.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-14-1">
</div>
<div id="outline-container-org93b75a2" class="outline-4">
<h4 id="org93b75a2"><span class="section-number-4">14.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-org628e057" class="outline-4">
<h4 id="org628e057"><span class="section-number-4">14.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org78c2da5" class="outline-4">
<h4 id="org78c2da5"><span class="section-number-4">14.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-org3fcb1c7" class="outline-2">
<h2 id="org3fcb1c7"><span class="section-number-2">15.</span> wktcolor</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org676500f" class="outline-3">
<h3 id="org676500f"><span class="section-number-3">15.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-15-1">
</div>
<div id="outline-container-orgae47cf5" class="outline-4">
<h4 id="orgae47cf5"><span class="section-number-4">15.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-15-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org741b990" class="outline-2">
<h2 id="org741b990"><span class="section-number-2">16.</span> wktplot</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-orga68f9d3" class="outline-3">
<h3 id="orga68f9d3"><span class="section-number-3">16.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-16-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-orge354b98" class="outline-2">
<h2 id="orge354b98"><span class="section-number-2">17.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-17">
</div>
<div id="outline-container-orgb3e9585" class="outline-3">
<h3 id="orgb3e9585"><span class="section-number-3">17.1.</span> Next step</h3>
<div class="outline-text-3" id="text-17-1">
</div>
<div id="outline-container-orgcf6d396" class="outline-4">
<h4 id="orgcf6d396"><span class="section-number-4">17.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-org15b248f" class="outline-2">
<h2 id="org15b248f"><span class="section-number-2">18.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-18">
</div>
<div id="outline-container-org77d510e" class="outline-3">
<h3 id="org77d510e"><span class="section-number-3">18.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-18-1">
</div>
<div id="outline-container-org067f036" class="outline-4">
<h4 id="org067f036"><span class="section-number-4">18.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-org963ad02" class="outline-2">
<h2 id="org963ad02"><span class="section-number-2">19.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-19">
</div>
<div id="outline-container-orgceebca6" class="outline-3">
<h3 id="orgceebca6"><span class="section-number-3">19.1.</span> Need to think about adding floating point support</h3>
</div>
<div id="outline-container-orge856801" class="outline-3">
<h3 id="orge856801"><span class="section-number-3">19.2.</span> Port to non-Linux OS</h3>
</div>
</div>
<div id="outline-container-orgf23f17c" class="outline-2">
<h2 id="orgf23f17c"><span class="section-number-2">20.</span> Swocer</h2>
<div class="outline-text-2" id="text-20">
</div>
<div id="outline-container-org1381f4d" class="outline-3">
<h3 id="org1381f4d"><span class="section-number-3">20.1.</span> Most crashing addressed</h3>
<div class="outline-text-3" id="text-20-1">
<p>
Nullified 'handle' API free functions helped a lot.
Still see some errors in operations.
</p>
</div>
</div>
<div id="outline-container-org579e90f" class="outline-3">
<h3 id="org579e90f"><span class="section-number-3">20.2.</span> Added outline for 'bottle' test</h3>
<div class="outline-text-3" id="text-20-2">
<p>
Added all functions believed to be needed for 'bottle' demo test.
Test doesn't pass so is disabled.
</p>
</div>
</div>
<div id="outline-container-orge40e6e4" class="outline-3">
<h3 id="orge40e6e4"><span class="section-number-3">20.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-20-3">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>